tools/load-tests/artillery/scenarios/session-upload.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
      maxVusers: 1
      name: 'Single user session upload'
  processor: '../helpers/session-processor.js'
  variables:
    apiKey: '{{ $env.API_KEY }}'
    notesCount: '{{ $env.NOTES_COUNT || 50 }}'
    assetsCount: '{{ $env.ASSETS_COUNT || 20 }}'
  plugins:
    expect: {}

scenarios:
  - name: 'Complete Session Upload Workflow'
    flow:
      # Step 1: Generate payloads
      - function: 'generateSessionPayloads'

      # Step 2: Create session
      - post:
          url: '/api/session/start'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesPlanned: '{{ notesCount }}'
            assetsPlanned: '{{ assetsCount }}'
            batchConfig:
              maxBytesPerRequest: 10485760
            ignoredTags: []
          capture:
            - json: '$.sessionId'
              as: 'sessionId'
          expect:
            - statusCode: 201
            - contentType: json
            - hasProperty: 'sessionId'

      # Step 3: Upload notes
      - post:
          url: '/api/session/{{ sessionId }}/notes/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notes: '{{ notes }}'
            cleanupRules: '{{ cleanupRules }}'
          expect:
            - statusCode: 200
            - contentType: json

      # Step 4: Upload assets
      - post:
          url: '/api/session/{{ sessionId }}/assets/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            assets: '{{ assets }}'
          expect:
            - statusCode: 200
            - contentType: json

      # Step 5: Finish session
      - post:
          url: '/api/session/{{ sessionId }}/finish'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesProcessed: '{{ notesCount }}'
            assetsProcessed: '{{ assetsCount }}'
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: 'success'

      - think: 2